app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-09-02 22:20:56.644875"], ["updated_at", "2019-09-02 22:20:56.644875"]]
---
  def create
    @student = Student.create(student_params(:first_name, :last_name))